Autodesk.Revit.DB.FDXImportOptions.SetLogOutputDirectory(System.String)
Sets the directory path where log files will be written during FDX import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023.0.2

Autodesk.Revit.DB.FDXImportOptions.#ctor(Autodesk.Revit.DB.Document)
Creates a new default set of options for ATF based import.
document:
Target document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023.0.2